app/views/home/index.html.erb

SELECT COUNT(*) FROM "trainers"
---
<h3>Welcome to PokePortal</h3>
<p><%= link_to 'Trainers:', trainers_path %> <%= Trainer.count %> registered</p>