app/controllers/pokemon_controller.rb

  def capture
    currPoke = Pokemon.find(params[:id])
    currPoke.trainer_id = current_trainer.id
    currPoke.save
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = 3  [["trainer_id", 1], ["updated_at", "2014-10-22 09:04:36.024750"]]