app/controllers/trainers_controller.rb

SELECT  "trainers".* FROM "trainers"  WHERE "trainers"."id" = 1  ORDER BY "trainers"."id" ASC LIMIT 1
SELECT "pokemons".* FROM "pokemons"  WHERE "pokemons"."trainer_id" = 1
---
  def show
    @trainer = Trainer.find(params[:id])
    @pokemon = Pokemon.where(trainer_id: @trainer)